//
// This file contains an 'Intel Peripheral Driver' and is      
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may 
// be modified by the user, subject to additional terms of the 
// license agreement                                           
//
// *++
//
// Copyright (c) 1999 - 2015 Intel Corporation. All rights reserved
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
// 
// 
// Module Name:
//
//   EventLogSetupStrings.uni
// 
// Abstract:
// 
//   String definitions for the event log screen
// 
// Revision History:
// 
// --*/

/=#

#langdef   en-US "English"
#langdef uqi "UQI"

//
// Event Log
//
#string STR_ELOG_FORM_TITLE             #language en-US "System Event Log"

#string STR_ELOG_MAIN_SCREEN_TITLE      #language en-US "System Event Main Screen "
#string STR_ELOG_FORM_HELP              #language en-US  "Press <Enter> to view or change the event log configuration."

#string STR_SYSTEM_ERRORS_PROMPT        #language en-US "System Errors"
#string STR_SYSTEM_ERRORS_HELP          #language en-US " System Error Enable/Disable/ Auto setup options. If Auto is selected the enabling or disbling of errors in the driver is skipped."

#string STR_ELOGMEM_FORM_TITLE          #language en-US "Memory Event Log"
#string STR_ELOGMEM_FORM_HELP           #language en-US  "Press <Enter> to view or change the Memory Event Log configuration."

#string STR_ERROR_CLOAKING_PROMPT        #language en-US "Enable/Disable Error Cloaking"
#string STR_ERROR_CLOAKING_HELP          #language en-US "Error Cloaking Feature to Hide CE Errors to OS"

#string STR_ELOGMEM_SUPPORT_PROMPT      #language en-US "Memory ELog Support"
#string STR_ELOGMEM_SUPPORT_HELP        #language en-US "Enable/Disable Memory Error logging support"

#string STR_ELOGMEM_CORR_SUPPORT_PROMPT #language en-US "Log Correctable Errors"
#string STR_ELOGMEM_CORR_SUPPORT_HELP   #language en-US "Enable/Disable Correctable Memory Error logging support"

#string STR_ELOGMEM_UC_SUPPORT_PROMPT   #language en-US "Log Un-Correctable Errors"
#string STR_ELOGMEM_UC_SUPPORT_HELP     #language en-US "Enable/Disable Un-Correctable Memory Error logging support"

#string STR_ELOGPCIE_FORM_TITLE         #language en-US "PCIe Event Log"
#string STR_ELOGPCIE_FORM_HELP          #language en-US  "Press <Enter> to view or change the PCIe Event Log configuration."

#string STR_ELOGPCIE_SUPPORT_PROMPT     #language en-US "PCIe ELog Support"
#string STR_ELOGPCIE_SUPPORT_HELP       #language en-US "Enable/Disable PCIe Error logging support"

#string STR_FATAL_ERR_PROMPT            #language en-US  "Log Fatal Error"
#string STR_FATAL_ERR_HELP              #language en-US  "Send system event Signal on Fatal error"

#string STR_NON_FATAL_ERR_PROMPT        #language en-US  "Log Non-Fatal Error"
#string STR_NON_FATAL_ERR_HELP          #language en-US "Send system event Signal on Non Fatal error"

#string STR_CORRECTABLE_ERR_PROMPT      #language en-US  "Log Correctable Error"
#string STR_CORRECTABLE_ERR_HELP        #language en-US  "Send system event Signal on Correctable error" 

#string STR_WHEA_FORM_TITLE             #language en-US "Whea Settings"
#string STR_WHEA_FORM_HELP              #language en-US  "Press <Enter> to view or change the WHEA configuration."

#string STR_WHEA_SUPPORT_PROMPT 	#language en-US "WHEA Support"
#string STR_WHEA_SUPPORT_HELP           #language en-US "Enable/Disable WHEA ACPI support" 

#string STR_WHEA_ACPI5_SUPPORT_PROMPT   #language en-US "WHEA Error Injection 5.0 Extension"
#string STR_WHEA_ACPI5_SUPPORT_HELP     #language en-US "Whea EINJ ACPI 5.0 support for set error type with address and vendor extensions."

#string STR_WHEA_FFM_LOG_PROMPT	        #language en-US "Whea Logging"
#string STR_WHEA_FFM_LOG_HELP           #language en-US "Enable/Disable Whea logging of errors."

#string STR_NATIVE_AER_PROMPT           #language en-US "Native AER"
#string STR_NATIVE_AER_HELP             #language en-US "Enable/Disable Native Advanced Error reporting capability."

#string STR_WHEA_PCIERRINJ_PROMPT 	#language en-US "WHEA PCIe Error Injection"
#string STR_WHEA_PCIERRINJ_HELP	        #language en-US "Enable/Disable WHEA PCIe Error Injection" 

#string STR_CHECK_PARITY_PROMPT         #language en-US "Parity Check"
#string STR_CHECK_PARITY_HELP           #language en-US "Enable/Disable Parity Check"

#string STR_PCIE_SYSTEM_ERROR_PROMPT    #language en-US "PCIe System Error"
#string STR_PCIE_SYSTEM_ERROR_HELP      #language en-US "Enable System Error reporting on all enumerated Root ports, bridges and devices"

#string STR_PCIE_PARITY_ERROR_PROMPT    #language en-US "PCIe Parity Error"
#string STR_PCIE_PARITY_ERROR_HELP      #language en-US "Enable Parity Error reporting on all enumerated Root ports, bridges and devices"

//
// End of file
//